
#Напишите программу, которая считывает длины двух катетов в
#прямоугольном треугольнике и выводит его площадь.
#Каждое число записано в отдельной строке.



c1 = int(input("Input item cathet c1 = "))
c2 = int(input("Input item cathet c2 = "))
print("area right triangle = " + str((c1 * c2)/2) )
    




