#Напишите программу, которая считывает целое число и выводит текст
#The next number for the number число is число+1. The previous
#number for the number число is число-1. С начала

num = int(input("Input number = "))
print("The next number for the number " + str(num)+" is " + str(num + 1))
print("The previous number for the number " + str(num)+" is " + str(num - 1))
